#### GetEnumerator Method

---

|  |
| --- |
| Definitions Class   See Also |

Retrieves an enumerator to the collection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<Definition> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of Definition) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<Definition^>^ GetEnumerator() ``` |

#### Return Value

The enumerator.

#### Implements

 IEnumerable T GetEnumerator

# See Also

Definitions Class

Autodesk.Revit.DB Namespace